In [185]:
import pandas as pd
import warnings
warnings.filterwarnings("ignore")

----------------------

## **LECTURA DE CSV**

Importamos todos los csv y limpiamos los datos que sean necesarios

In [186]:
clase1=pd.read_csv("data/clase_1.csv", sep =";")
clase1.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto
1,Jorge Manzanares,Jorge_Manzanares@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto
2,Onofre Adadia,Onofre_Adadia@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,No Apto,Apto
3,Merche Prada,Merche_Prada@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,No Apto,Apto,No Apto
4,Pilar Abella,Pilar_Abella@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,Apto,Apto

In [187]:
clase2=pd.read_csv("data/clase_2.csv", sep =";")
clase2.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_HLF,Proyecto_EDA,Proyecto_BBDD,Proyecto_ML,Proyecto_Deployment
0,Guillermo Borrego,Guillermo_Borrego@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,No Apto,Apto,No Apto
1,Sergio Aguirre,Sergio_Aguirre@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,Apto,Apto,No Apto
2,Carlito Carrión,Carlito_Carrión@gmail.com,Febrero,12/02/2024,Madrid,Apto,No Apto,Apto,Apto,Apto
3,Haydée Figueroa,Haydée_Figueroa@gmail.com,Febrero,12/02/2024,Madrid,Apto,Apto,Apto,Apto,Apto
4,Chita Mancebo,Chita_Mancebo@gmail.com,Febrero,12/02/2024,Madrid,No Apto,Apto,No Apto,Apto,Apto

In [188]:
clase3=pd.read_csv("data/clase_3.csv", sep =";")
clase3.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullSatck
0,Amor Larrañaga,Amor_Larrañaga@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,Apto,No Apto
1,Teodoro Alberola,Teodoro_Alberola@gmail.com,Septiembre,18/09/2023,Madrid,No Apto,No Apto,Apto,No Apto,Apto
2,Cleto Plana,Cleto_Plana@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,No Apto,Apto
3,Aitana Sebastián,Aitana_Sebastián@gmail.com,Septiembre,18/09/2023,Madrid,Apto,No Apto,Apto,No Apto,Apto
4,Dolores Valbuena,Dolores_Valbuena@gmail.com,Septiembre,18/09/2023,Madrid,Apto,Apto,Apto,Apto,No Apto

In [189]:
clase4=pd.read_csv("data/clase_4.csv", sep =";")
clase4.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto_WebDev,Proyecto_FrontEnd,Proyecto_Backend,Proyecto_React,Proyecto_FullSatck
0,Teresa Laguna,Teresa_Laguna@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,Apto,Apto,Apto
1,Estrella Murillo,Estrella_Murillo@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,No Apto,Apto,Apto
2,Ernesto Uriarte,Ernesto_Uriarte@gmail.com,Febrero,12/02/2024,Valencia,Apto,Apto,Apto,Apto,Apto
3,Daniela Guitart,Daniela_Guitart@gmail.com,Febrero,12/02/2024,Valencia,Apto,No Apto,No Apto,Apto,Apto
4,Timoteo Trillo,Timoteo_Trillo@gmail.com,Febrero,12/02/2024,Valencia,No Apto,Apto,Apto,Apto,No Apto

In [190]:
total_clases= pd.read_csv("data/total_clases.csv")
total_clases.drop(columns="Unnamed: 0",inplace=True)
total_clases.head()

,Nombre,Email,Promoción,Fecha_comienzo,Campus,Proyecto,Calificación
0,Jafet Casals,Jafet_Casals@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
1,Jorge Manzanares,Jorge_Manzanares@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
2,Onofre Adadia,Onofre_Adadia@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
3,Merche Prada,Merche_Prada@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto
4,Pilar Abella,Pilar_Abella@gmail.com,Septiembre,18/09/2023,Madrid,Proyecto_HLF,Apto

In [191]:
claus = pd.read_csv("data/claustro.csv",sep = ";")
claus.head()

              Nombre Rol Vertical   Promocion    Campus   Modalidad
0          Noa Yáñez  TA       DS  Septiembre    Madrid  Presencial
1  Saturnina Benitez  TA       DS  Septiembre    Madrid  Presencial
2         Anna Feliu  TA       FS  Septiembre    Madrid  Presencial
3      Rosalva Ayuso  TA       FS  Septiembre  Valencia  Presencial
4   Ana Sofía Ferrer  TA       FS     Febrero  Valencia  Presencial

-------------------

----------

# **TABLAS**

1. **ALUMNOS**

Hacemos un DataFrame con los datos unicos de cada alumno, nombre y email que obtenemos de los datos de todas las clases. Si los datos de las clases cambian se incluyen con un id unico.

In [235]:
alumnos = pd.DataFrame({"Nombre": total_clases["Nombre"].unique(),"Email":total_clases["Email"].unique()})
alumnos.insert(0, 'id_alumnos', range(1, len(alumnos) + 1))

In [236]:
alumnos.head()

   id_alumnos            Nombre                       Email
0           1      Jafet Casals      Jafet_Casals@gmail.com
1           2  Jorge Manzanares  Jorge_Manzanares@gmail.com
2           3     Onofre Adadia     Onofre_Adadia@gmail.com
3           4      Merche Prada      Merche_Prada@gmail.com
4           5      Pilar Abella      Pilar_Abella@gmail.com

-------------------------

2. **VERTICALES**

En esta tabla consideramos las areas en las que se clasifican los bootcamp. Estos datos los tenemos de los datos generales del claustro de profesores

In [237]:
verticales= pd.DataFrame({"Nombre":claus["Vertical"].unique()})
verticales.insert(0, 'id_verticales', range(1, len(verticales) + 1))

In [238]:
verticales.head()

   id_verticales Nombre
0              1     DS
1              2     FS

-----------------------------------

3. **CAMPUS**

En esta tabla asignamos un identificador a los campus que pueda tener TheBridge

In [239]:
campus= pd.DataFrame({"Nombre":total_clases["Campus"].unique()})
campus.insert(0, 'id_campus', range(1, len(campus) + 1))

In [240]:
campus.head()

   id_campus    Nombre
0          1    Madrid
1          2  Valencia

-----------------------

4. **CLAUSTRO**

Sacamos una tabla con los datos de cada profesor, nombre, vertical a la que pertenece y rol dentro de la clase. Cada profesor tendrá una identificación unica con estas caracteristicas

In [241]:
claustro1=pd.DataFrame({"nombre":claus["Nombre"],"vertical":claus["Vertical"],"Rol":claus["Rol"]})
claustro1.insert(0, 'id_profesor', range(1, len(claustro1) + 1))

In [242]:
claustro = pd.merge(claustro1, verticales, left_on='vertical', right_on='Nombre', how='left')
claustro= claustro.loc[:,["id_profesor","nombre","id_verticales","Rol"]]
claustro

   id_profesor              nombre  id_verticales Rol
0            1           Noa Yáñez              1  TA
1            2   Saturnina Benitez              1  TA
2            3          Anna Feliu              2  TA
3            4       Rosalva Ayuso              2  TA
4            5    Ana Sofía Ferrer              2  TA
5            6     Angélica Corral              2  TA
6            7         Ariel Lledó              1  TA
7            8         Mario Prats              2  LI
8            9   Luis Ángel Suárez              2  LI
9           10  María Dolores Diaz              1  LI

-------------------------------

5. **MODALIDAD**

Para que sea escalable y poder considerar otras características en un futuro hacemos una tabla donde diferenciamos si el curso es presencial/Online y Full time / Part time. En este caso como no tenemos información suponemos que todas las clases son presenciales y Full time

In [243]:
claus['Modalidad'] = claus['Modalidad'].replace({'Presencial': True, 'Online': False})#cambiamos a bool los datos

In [244]:
modalidad=pd.DataFrame({"Presencial":claus['Modalidad'].unique()})
modalidad.insert(0, 'id_modalidad', range(1, len(modalidad) + 1))
modalidad['FullTime'] = [True,False]

In [245]:
modalidad.loc[2]=[3,True,False]

In [246]:
modalidad.loc[3]=[4,False,True]

In [247]:
modalidad

   id_modalidad  Presencial  FullTime
0             1        True      True
1             2       False     False
2             3        True     False
3             4       False      True

----------------------------

6. **PROYECTOS**

Para futuros cambios hacemos un diccionario donde identificamos todos sus proyectos. En el caso de que se añada una nueva vertical solo hace falta modificar el diccionario, añadiendo la nueva modalidad con sus proyectos.

In [248]:
vertical_rules = {
    "FS": ['Proyecto_WebDev', 'Proyecto_FrontEnd', 'Proyecto_Backend', 
           'Proyecto_React', 'Proyecto_FullSatck'],
    "DS": ['Proyecto_HLF', 'Proyecto_EDA', 'Proyecto_BBDD', 'Proyecto_ML',
       'Proyecto_Deployment']
}#si hay nuevos proyectos o nuevas verticales solo añadimos al diccionario

In [249]:
def asignar_vertical(proyecto):
    for vertical, proyectos in vertical_rules.items():
        if proyecto in proyectos:
            return vertical
    return 'Desconocido'

Esta función nos permite no tener que modificar el código donde se crea la tabla

In [250]:
total_clases["Vertical"] = total_clases["Proyecto"].apply(asignar_vertical)

In [251]:
proyectos1 = total_clases.groupby("Proyecto")["Vertical"].unique().reset_index()
proyectos1["Vertical"] = proyectos1["Vertical"].str[0]#quitar corquetes de las listas generadas [DS]
proyectos1.insert(0, 'id_proyecto', range(1, len(proyectos1) + 1))

In [252]:
proyectos = pd.merge(proyectos1, verticales, left_on='Vertical', right_on='Nombre', how='left')
proyectos= proyectos.loc[:,["id_proyecto","Proyecto","id_verticales"]]
proyectos

   id_proyecto             Proyecto  id_verticales
0            1        Proyecto_BBDD              1
1            2     Proyecto_Backend              2
2            3  Proyecto_Deployment              1
3            4         Proyecto_EDA              1
4            5    Proyecto_FrontEnd              2
5            6   Proyecto_FullSatck              2
6            7         Proyecto_HLF              1
7            8          Proyecto_ML              1
8            9       Proyecto_React              2
9           10      Proyecto_WebDev              2

---------------------------

7. **BOOTCAMP**

In [253]:
bootcamp1=pd.DataFrame({"Promocion":total_clases["Promoción"],"F_comienzo":total_clases["Fecha_comienzo"],
                        "campus":total_clases["Campus"],"vertical":total_clases["Vertical"]})

In [254]:
bootcamp= pd.merge(bootcamp1, verticales, left_on='vertical', right_on='Nombre', how='left')
bootcamp= pd.merge(bootcamp, campus, left_on='campus', right_on='Nombre', how='left')
bootcamp["id_modalidad"]=modalidad.iloc[0,0]
bootcamp=bootcamp.drop_duplicates(["Promocion","F_comienzo","id_campus","id_modalidad","id_verticales"]).reset_index()
bootcamp.insert(0, 'id_bootcamp', range(1, len(bootcamp) + 1))
bootcamp.drop(columns="index",inplace=True)
bootcamp_cruce = bootcamp
bootcamp_cruce

,id_bootcamp,Promocion,F_comienzo,campus,vertical,id_verticales,Nombre_x,id_campus,Nombre_y,id_modalidad
0,1,Septiembre,18/09/2023,Madrid,DS,1,DS,1,Madrid,1
1,2,Febrero,12/02/2024,Madrid,DS,1,DS,1,Madrid,1
2,3,Septiembre,18/09/2023,Madrid,FS,2,FS,1,Madrid,1
3,4,Febrero,12/02/2024,Valencia,FS,2,FS,2,Valencia,1

In [255]:
bootcamp=bootcamp.loc[:,['id_bootcamp',"Promocion","F_comienzo","id_campus","id_verticales","id_modalidad"]]

In [256]:
bootcamp

   id_bootcamp   Promocion  F_comienzo  id_campus  id_verticales  id_modalidad
0            1  Septiembre  18/09/2023          1              1             1
1            2     Febrero  12/02/2024          1              1             1
2            3  Septiembre  18/09/2023          1              2             1
3            4     Febrero  12/02/2024          2              2             1

-------------------------------

8. **CALIFICACIONES**

In [257]:
total_clases["Calificación"] = total_clases["Calificación"] .replace({'Apto': True, 'No Apto': False})#cambiamos a bool los datos

In [258]:
calificaciones1=pd.DataFrame({"nombre_alumnos":total_clases["Nombre"],"nombre_proyecto":total_clases["Proyecto"],"Nota":total_clases["Calificación"]})
calificaciones1.insert(0, 'id_calificaciones', range(1, len(calificaciones1) + 1))

In [259]:
calificaciones= pd.merge(calificaciones1, alumnos, left_on='nombre_alumnos', right_on='Nombre', how='left')
calificaciones= pd.merge(calificaciones, proyectos, left_on='nombre_proyecto', right_on='Proyecto', how='left')
calificaciones=calificaciones.loc[:,["id_calificaciones","id_alumnos","id_proyecto","Nota"]]

In [260]:
calificaciones.head()

   id_calificaciones  id_alumnos  id_proyecto  Nota
0                  1           1            7  True
1                  2           2            7  True
2                  3           3            7  True
3                  4           4            7  True
4                  5           5            7  True

-----------------

9. **ALUMNOS_CLASE**

In [261]:
a_alumnos = pd.merge(total_clases, bootcamp_cruce, left_on=['Promoción','Fecha_comienzo','Campus', 'Vertical'], right_on=['Promocion','F_comienzo','campus','vertical'], how='left')
a_alumnos = a_alumnos.loc[:,['Nombre','id_bootcamp']]
a_alumnos = pd.merge(a_alumnos, alumnos, left_on=['Nombre'], right_on=['Nombre'], how='left')
a_alumnos.drop_duplicates(subset=["Nombre","id_bootcamp","id_alumnos","Email"],inplace=True,ignore_index=True)
a_alumnos = a_alumnos.loc[:,['id_bootcamp', 'id_alumnos']]
a_alumnos.insert(0, 'id_aclase', range(1, len(a_alumnos) + 1))
a_alumnos.head()

   id_aclase  id_bootcamp  id_alumnos
0          1            1           1
1          2            1           2
2          3            1           3
3          4            1           4
4          5            1           5

-----------------

10.**PROFESORES_CLASE**

In [262]:
p_clase = pd.merge(claus, bootcamp_cruce, left_on=['Promocion','Campus', 'Vertical'], right_on=['Promocion','campus','vertical'], how='left')
p_clase = p_clase.loc[:,['Nombre','id_bootcamp']]
p_clase = pd.merge(p_clase, claustro, left_on=['Nombre'], right_on=['nombre'], how='left')
p_clase = p_clase.loc[:,['id_bootcamp', 'id_profesor']]
p_clase.insert(0, 'id_pclase', range(1, len(p_clase) + 1))
p_clase.dropna(inplace=True)

In [263]:
p_clase["id_bootcamp"] = p_clase["id_bootcamp"].astype("int")

In [264]:
p_clase.head()

   id_pclase  id_bootcamp  id_profesor
0          1            1            1
1          2            1            2
2          3            3            3
4          5            4            5
6          7            1            7

-------------

## **HOMOGENEIZAR LAS TABLAS**

In [265]:
a_clase=a_alumnos
a_clase.rename(columns={"id_alumnos":"id_alumno"},inplace=True)

In [266]:
alumnos.rename(columns={"id_alumnos":"id_alumno","Nombre":"nombre","Email":"email"},inplace=True)

In [267]:
bootcamp.rename(columns={"Promocion":"promocion","F_comienzo":"f_comienzo","id_verticales":"id_vertical"},inplace=True)

In [268]:
bootcamp["f_comienzo"]= pd.to_datetime(bootcamp["f_comienzo"], format='%d/%m/%Y')

In [269]:
calificaciones.rename(columns={"id_calificaciones":"id_calif","id_alumnos":"id_alumno","Nota":"nota"},inplace=True)

In [270]:
campus.rename(columns={"Nombre":"nombre"},inplace=True)

In [271]:
claustro.rename(columns={"id_verticales":"id_vertical","Rol":"rol"},inplace=True)

In [272]:
modalidad.rename(columns={"Presencial":"presencial","FullTime":"fulltime"},inplace=True)

In [273]:
proyectos.rename(columns={"Proyecto":"nombre","id_verticales":"id_vertical"},inplace=True)

In [274]:
verticales.rename(columns={"Nombre":"nombre","id_verticales":"id_vertical"},inplace=True)

DICCIONARIOS

In [275]:
dic_sql={"campus":campus,
         "verticales":verticales,
         "modalidad":modalidad,
         "claustro":claustro,
         "bootcamp":bootcamp,
         "proyectos":proyectos,
         "p_clase":p_clase,
         "alumnos":alumnos,
         "calificaciones":calificaciones,
         "a_clase":a_clase
      }

In [276]:
from sqlalchemy import create_engine
engine = create_engine('postgresql://school_db_hkla_user:S8tvOM5YVinPoWddRVHG8Q4qMr3TFSek@dpg-cu8fnnl6l47c738hj8v0-a.frankfurt-postgres.render.com:5432/school_db_hkla')
def upload_tables(dict, engine):
    for table_name, dataframe in dict.items():
        dataframe.to_sql(
            name=table_name,  # Use the key as the table name
            con=engine,       # Database engine
            if_exists="append",  # If the table exists, append
            index=False        # Do not write the index
        )

In [277]:
#upload_tables(dic_sql,engine)